
TOKEN = "5263070884:AAGRUPhMy68le_bYaj_9XHMyUB8DlMFmdLY"


# Словар Ключ: значение == key: value для нашик валют
keys = {
    'Биткоин': 'BTC',
    'Эфириум': 'ETH',
    'Доллар': 'USD',
    'Крона': 'CZK',
    'Рубль': 'RUB',
    'Евро': 'EUR',
    'биткоин': 'BTC',
    'эфириум': 'ETH',
    'доллар': 'USD',
    'крона': 'CZK',
    'рубль': 'RUB',
    'евро': 'EUR',
    'биткоинов': 'BTC',
    'эфириумов': 'ETH',
    'долларов': 'USD',
    'кронн': 'CZK',
    'рублей': 'RUB',
    'Биткоины': 'BTC',
    'Эфириумы': 'ETH',
    'Доллары': 'USD',
    'Кроны': 'CZK',
    'Рубли': 'RUB',
    'биткоины': 'BTC',
    'эфириумы': 'ETH',
    'доллары': 'USD',
    'кроны': 'CZK',
    'рубли': 'RUB',
}

Currencies = {
    'Биткоин': 'BTC',
    'Эфириум': 'ETH',
    'Доллар': 'USD',
    'Крона': 'CZK',
    'Рубль': 'RUB',
    'Евро': 'EUR',
}